In [1]:
import pandas as pd
import numpy  as np

In [17]:
df=pd.Series(dtype=None,index=None,data=None,copy=False)
df1=pd.Series(index=[1,2,3,4,5,6,7],data=['a','b','k','j','l','p','q'],name='PSeries')

C:\Users\knwafor\AppData\Local\Temp/ipykernel_15332/1220666646.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  df=pd.Series(dtype=None,index=None,data=None,copy=False)

In [24]:
df1

1    a
2    b
3    k
4    j
5    l
6    p
7    q
Name: PSeries, dtype: object

In [25]:
df1.dtype

dtype('O')

In [26]:
df1.T

1    a
2    b
3    k
4    j
5    l
6    p
7    q
Name: PSeries, dtype: object

In [28]:
df1.array

<PandasArray>
['a', 'b', 'k', 'j', 'l', 'p', 'q']
Length: 7, dtype: object

### Creating a pandas series

### Using list

In [116]:
lst=['a','b','k','j','l','p','q']
df_list=pd.Series(index=[1,2,3,4,5,6,7],data=lst,name='PSeries')

In [117]:
df_list

1    a
2    b
3    k
4    j
5    l
6    p
7    q
Name: PSeries, dtype: object

### using  dictionary

In [118]:
lst={'a': 1, 'b': 2, 'c': 3}
df_dict=pd.Series(data=lst,name='PSeries')

In [119]:
df_dict

a    1
b    2
c    3
Name: PSeries, dtype: int64

### Using an array

In [120]:
lst=np.array([1,2,4,2,3,4,5,6,7,8,3,4,5,6,7])
# indx=['a','b','k','j','l','p','q']
df_arr=pd.Series(data=lst,name='PSeries')

In [121]:
df_arr

0     1
1     2
2     4
3     2
4     3
5     4
6     5
7     6
8     7
9     8
10    3
11    4
12    5
13    6
14    7
Name: PSeries, dtype: int32

In [122]:
df_arr.iloc[6]=9

In [123]:
df_arr

0     1
1     2
2     4
3     2
4     3
5     4
6     9
7     6
8     7
9     8
10    3
11    4
12    5
13    6
14    7
Name: PSeries, dtype: int32

In [124]:
df_arr[5]=24

In [125]:
df_arr

0      1
1      2
2      4
3      2
4      3
5     24
6      9
7      6
8      7
9      8
10     3
11     4
12     5
13     6
14     7
Name: PSeries, dtype: int32

#### Converting Pandas Series to an list or numpy array

In [126]:
ser_arr=pd.Series(df_arr).array

In [127]:
ser_arr

<PandasArray>
[1, 2, 4, 2, 3, 24, 9, 6, 7, 8, 3, 4, 5, 6, 7]
Length: 15, dtype: int32

In [128]:
ser_arr.unique()

<PandasArray>
[1, 2, 4, 3, 24, 9, 6, 7, 8, 5]
Length: 10, dtype: int32

In [138]:
df=pd.DataFrame(ser_arr,columns=['first'])

In [139]:
df

    first
0       1
1       2
2       4
3       2
4       3
5      24
6       9
7       6
8       7
9       8
10      3
11      4
12      5
13      6
14      7

In [141]:
ser_arr.mean()

6.066666666666666

In [148]:
ser_arr

<PandasArray>
[1, 2, 4, 2, 3, 24, 9, 6, 7, 8, 3, 4, 5, 6, 7]
Length: 15, dtype: int32

### Pandas DataFrame

#### Creating A DataFrame

- Using A lists in a list
- Using  list of dictionary
- Using dictionary in a dictionary
- Using a list of tuples
- From a database table
- From a csv file
- From an excel file
- Html table
- Json

#### A list in a list

In [169]:
records=[['Alice', 19, "F", "actor"],
['Peter', 18, "M", "student"],
['Aayub', 15, "M", "student"],
['Kingsley', 17, "M", "student"],
['John', 17, "M", "student"],
['Seyi', 16, "F", "student"],
['Bayo', 19, "M", "footballer"],
['Grace', 15, "F", "student"],
['Asake', 17, "F", "singer"],
['Mike', 20, "M", "Basketballer"]]
columns=['name', 'age', 'gender', 'job']

##### class pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=None)[source]

In [175]:
df_list_=pd.DataFrame(data=records,columns=columns)
df_list_

       name  age gender           job
0     Alice   19      F         actor
1     Peter   18      M       student
2     Aayub   15      M       student
3  Kingsley   17      M       student
4      John   17      M       student
5      Seyi   16      F       student
6      Bayo   19      M    footballer
7     Grace   15      F       student
8     Asake   17      F        singer
9      Mike   20      M  Basketballer

In [184]:
def changing_a_column_to_a_list(column):
    np_arr=np.array(column)
    name_=np_arr.tolist()
    return name_
name_=changing_a_column_to_a_list(df_list_.name)
age_=changing_a_column_to_a_list(df_list_.age)
gender_=changing_a_column_to_a_list(df_list_.gender)
job_=changing_a_column_to_a_list(df_list_.job)

#### Using A Dictionary to create a pandas DataFrame

In [185]:
d = {'Name':name_ , 'age': age_,'gender':gender_,'job':job_}
df = pd.DataFrame(data=d)
df

       Name  age gender           job
0     Alice   19      F         actor
1     Peter   18      M       student
2     Aayub   15      M       student
3  Kingsley   17      M       student
4      John   17      M       student
5      Seyi   16      F       student
6      Bayo   19      M    footballer
7     Grace   15      F       student
8     Asake   17      F        singer
9      Mike   20      M  Basketballer

#### Dictionary in a dictionary

In [197]:

people = {'Name': {'name': 'John', 'age': '27', 'gender': 'Male' },
          'Age': {'name': 'Marie', 'age': '22', 'gender': 'Female'},
         'Gender': {'name': 'Marie', 'age': '22', 'gender': 'Female'},
         'job': {'name': 'kngsely', 'age': 22, 'gender': }}
pd.DataFrame(people)

        Name     Age  Gender      job
name    John   Marie   Marie  kngsely
age       27      22      22       22
gender  Male  Female  Female       25

#### creating a dataframe using a list of tuples

In [200]:
d=[('Alice', 19, "F", "actor"),
('Peter', 18, "M", "student"),
('Aayub', 15, "M", "student"),
('Kingsley', 17, "M", "student")]

In [204]:
df = pd.DataFrame(data=d,columns=columns)
df

       name  age gender      job
0     Alice   19      F    actor
1     Peter   18      M  student
2     Aayub   15      M  student
3  Kingsley   17      M  student

#### Using csv

In [208]:
filepath=r"C:\Users\knwafor\Downloads\annual-enterprise-survey-2021-financial-year-provisional-csv.csv"
df=pd.read_csv(filepath)
df.head()

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2021,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,"757,504",ANZSIC06 divisions A-S (excluding classes K633...
1,2021,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,"674,890",ANZSIC06 divisions A-S (excluding classes K633...
2,2021,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,"49,593",ANZSIC06 divisions A-S (excluding classes K633...
3,2021,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,"33,020",ANZSIC06 divisions A-S (excluding classes K633...
4,2021,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,"654,404",ANZSIC06 divisions A-S (excluding classes K633...

In [210]:
pd.read_csv(r'https://www.stats.govt.nz/assets/Uploads/Annual-enterprise-survey/Annual-enterprise-survey-2021-financial-year-provisional/Download-data/annual-enterprise-survey-2021-financial-year-provisional-csv.csv')

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2021,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,"757,504",ANZSIC06 divisions A-S (excluding classes K633...
1,2021,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,"674,890",ANZSIC06 divisions A-S (excluding classes K633...
2,2021,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,"49,593",ANZSIC06 divisions A-S (excluding classes K633...
3,2021,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,"33,020",ANZSIC06 divisions A-S (excluding classes K633...
4,2021,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,"654,404",ANZSIC06 divisions A-S (excluding classes K633...
...,...,...,...,...,...,...,...,...,...,...
41710,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H37,Quick ratio,Financial ratios,52,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41711,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H38,Margin on sales of goods for resale,Financial ratios,40,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41712,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H39,Return on equity,Financial ratios,12,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41713,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H40,Return on total assets,Financial ratios,5,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41714,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H41,Liabilities structure,Financial ratios,46,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."

#### Html

In [218]:
df=pd.read_html(r'https://www.worldometers.info/geography/alphabetical-list-of-countries/')[0]
df

       #      Country  Population(2020)  Land Area (Km²)  Density(P/Km²)
0      1  Afghanistan          38928346           652860              60
1      2      Albania           2877797            27400             105
2      3      Algeria          43851044          2381740              18
3      4      Andorra             77265              470             164
4      5       Angola          32866272          1246700              26
..   ...          ...               ...              ...             ...
190  191    Venezuela          28435940           882050              32
191  192      Vietnam          97338579           310070             314
192  193        Yemen          29825964           527970              56
193  194       Zambia          18383955           743390              25
194  195     Zimbabwe          14862924           386850              38

[195 rows x 5 columns]

In [155]:

pd.DataFrame({"product":{"0":"computer","1":"tablet","2":"printer","3":"keyboard"},"price":{"0":800,"1":350,"2":200,"3":120}})

    product  price
0  computer    800
1    tablet    350
2   printer    200
3  keyboard    120